[
    {
        "_id": "62be0ee0bd4ac60023a75ac3",
        "rewardGrid": {
            "low": "677",
            "medium": "778",
            "high": "8899",
            "critical": "787"
        },
        "tags": [
            "sample tag"
        ],
        "accountCredentials": "hdfhsr",
        "private": false,
        "allowCollaborations": false,
        "scope": [
            {
                "webApplication": "ndfhfhdtj.com",
                "api": "dsfaegesge.nh",
                "androidApp": "gdgseg.com",
                "playstoreId": "4567678"
            },
            {
                "webApplication": "sdgsgseg",
                "api": "hsrhsrhstrhr",
                "androidApp": "srhsrhsr",
                "playstoreId": "rhsrhsr"
            },
            {
                "webApplication": "rshsrhsrrsh",
                "api": "hsrhsrsrh",
                "androidApp": "hsrhsrhsrh",
                "playstoreId": "rshsrhsrh"
            }
        ],
        "outofscope": [
            {
                "webApplication": "sgrgsg.com",
                "api": "ftjdtjtj.com",
                "androidApp": "com.ftehjetj.com",
                "playstoreId": "55757"
            }
        ],
        "participants": [],
        "status": "In Progress",
        "banner": "https://storage.googleapis.com/teklabspace.appspot.com/company/banner/1656426208055.png",
        "thumbnail": "https://storage.googleapis.com/teklabspace.appspot.com/undefined/16564262080552.png",
        "companyId": "62ba7c23555376002333eae4",
        "type": "Compliance",
        "title": "Tesla Black team",
        "reward": "Hall Of Fame",
        "description": "#POLICY RULE\r\n\r\n-\tAn asset must be listed as reward eligible in our Scopes section of the policy to qualify for a bounty.\r\n-\tOnly reports closed as Resolved will qualify for a bounty.\r\n-\tExact payouts within each range are determined by calculations related to the CVSS3 score for the individual report.\r\n-\tReports prior to September 28th, 2020 may have used a CVSS calculation impacted by a setting in Teklabspace that adjusted the environmental score. Due to the platform limitations related to how this functions and is displayed, the severity and reward may appear inconsistent.\r\n-\tReports that were triaged or rewarded based on prior program policy versions, rules and processes should not be used for comparison against current reports.\r\n-\tLast updated on September 28, 2020.\r\n\r\n## Policy\r\nCompany_Name believes in a program that fosters collaboration among security professionals to help protect our systems and customers’ personal information from malicious activity and to help set security policies across our organization. We value the security and safety of our customers’ personal information above all.\r\nFor the protection of our customers, Company_Name does not publicly disclose, discuss, or confirm security matters before comprehensively investigating, diagnosing, and fixing any known issues.\r\n\r\n\r\n\r\n### Table of Contents\r\n\r\nProgram\r\n1.\tLegal\r\n2.\tProgram Eligibility\r\n3.\tProgram Rules\r\n\r\nReport Submissions\r\n1.\tWhat is required when submitting a report?\r\n2.\tWhat happens after you submit a report?\r\n3.\tHow do I make my report great?\r\n4.\tWhat causes a report to be closed as Informative, Duplicate, N/A, or Spam?\r\nHelpful Hints\r\nFAQ's\r\n\r\n## Program\r\n\r\n1. Legal\r\nCompany_Name reserves the right to modify terms and conditions of this program and your participation in the program constitutes acceptance of all terms. Please check this site regularly as we routinely update our program terms and eligibility, which are effective upon posting. We reserve the right to cancel this program at any time. Must be 18 or older to be eligible for an award.\r\n\r\n2. Program Eligibility\r\n-\tYou must agree and adhere to the Program Rules and Legal terms as stated in this policy.\r\n-\tYou must be the first to submit a sufficiently reproducible report for an issue in order to be eligible for a bounty.\r\n-\tYou must be available to supply additional information, as needed by our team, to reproduce and triage the issue.\r\n-\tZero-day vulnerabilities will not be considered for eligibility until more than 30 days have passed since patch availability.\r\n-\tOut-of-scope vulnerability reports may be addressed as a form of vulnerability disclosure but will generally not be considered reward eligible.\r\n-\tCompany_Name partners (employees) and vendors are not eligible for participation in this program.\r\n\r\n3. Program Rules\r\nDo\r\n-\tRead and abide by the program policy.\r\n-\tPerform testing using only accounts that are your own personal/test accounts or an account that you have the explicit permission from the account holder to utilize.\r\n-\tExercise caution when testing to avoid negative impact to customers and the services they depend on.\r\n-\tStop when unsure. If you think you may cause, or have caused, damage with testing a vulnerability, report your initial finding(s) and request authorization to continue testing.\r\n\r\nDo NOT\r\n-\tDo not Brute force credentials or guess credentials to gain access to systems.\r\n-\tDo not participate in denial of service attacks.\r\n-\tDo not upload shells or create a backdoor of any kind.\r\n-\tDo not engage in any form of social engineering of Company_Name employees, customers, or vendors.\r\n-\tDo not engage or target any Company_Name employee, customer or vendor during your testing.\r\n-\tDo not attempt to extract, download, or otherwise exfiltrate data which you believe may have PII other than your own.\r\n-\tDo not change passwords of any account that is not yours or that you do not have explicit permission to change. If ever prompted to change a password, stop and report the finding immediately.\r\n-\tDo not publicly disclose vulnerability reports that are not resolved and approved for disclosure by Company_Name.\r\n-\tDo not submit reports here as a means to engage us to buy your products or services. Please direct your sales inquiries through proper channels.\r\n\r\n\r\n## Report Submissions\r\n\r\n1. What is required when submitting a report?\r\nProvide the information asked for by the new report form, following the instructions there. Some important considerations include:\r\n-\tTitle – this should be a quick and clear summary of your issue.\r\n-\tAsset – this should match exactly the asset you are reporting, or “Other”.\r\n-\tSeverity – the CVSS calculator is used to evaluate severity and bounty, so to avoid disappointment, be honest and critical when scoring severity.\r\n-\tWeakness – select the most appropriate vulnerability type.\r\n-\tDescription – provide all the requested fields.\r\n\r\n2. What happens after you submit a report?\r\n\r\nTeklabspace triage staff will perform the initial validation of your report. They will confirm it is well understood, reproducible, has security impact, and is otherwise in line with our program policy and scope.\r\nTeklabspace triage may close the report as \"Duplicate\", \"Informative\", \"N/A\", \"Spam\", or continue to work with you if more information is needed. They will not move the report to \"Triaged\".\r\n Once validated by Teklabspace, the triager will assign the report to Company_Name, letting you know in the report with a short message to that effect.\r\nThe Company_Name team will then review your report. We will be working on the issue but may not have enough information to immediately move it from \"New\" to \"Triage\". As a global company, we often need to engage with teams across multiple time zones so we may need additional time to fully validate the report.\r\nCompany_Name will \"Triage\" valid & eligible reports that we intend to take action on. During this time, we will work with our internal teams to resolve the issue and follow up to close the report as \"Resolved\".\r\n\r\nRewards\r\n\r\nReward amounts are calculated based on the numerical CVSS score assigned to the report.\r\nWe strive to pay bounty on \"Triage\" and will do so when there is high confidence in the accuracy of the assigned scope and severity. Occasionally, we may need to delay payment until we fully investigate the details of a report.\r\n-\tAll bounty amounts will be at the discretion of the Company_Name Bug Bounty team.\r\n-\tReports submitted using methods that violate policy rules will not be eligible for reward.\r\n-\tTo be eligible for a reward, the report must be for a reward eligible asset as defined in the scope section of our policy.\r\n\r\n-\tReports where the researcher has confirmed and reported the same vulnerability on multiple assets, with the same root cause, may qualify for a 1.5 multiplier on their bounty award. Do not submit duplicate reports for the same issue across multiple sites as the duplicates will be closed and the issue will be treated as one report.\r\n-\tWhile we aim for consistency, previous reports and prior bounty amounts do not set a precedent and are not to be used for negotiating a higher reward. Changes to policy and the occasional human error should be considered.\r\n-\tUnderstand that there could be submissions for which we accept the risk, have other compensating controls, or will not address in the manner expected.\r\n\r\nDisclosure Requests\r\n\r\nOnce Name_of_Company receives your official disclosure request, we may take the following actions:\r\n-\tRedact any sensitive information.\r\n-\tInclude a Name_of_Company provided summary.\r\n-\tMake adjustments to report metadata to ensure clarity and accuracy, if needed.\r\nOnly reports for in-scope assets that have been closed as 'Resolved' will be considered for disclosure.\r\nDisclosure requests must be received within 90 days of the report being closed as 'Resolved'.\r\n\r\n3. How do I make my report great?\r\nGreat reports lead to quicker resolution and more accurate reward.\r\n-\tClearly describe the impact your finding would have on Company_Name assets or Company_Name customers and how this could be exploited.\r\n-\tUtilize the CVSS v3 calculator to thoughtfully score your report.\r\n-\tInclude detailed and easy to follow reproduction steps along with screenshots and videos to support your finding.\r\n-\tBe sure to include the environment used for testing (browsers, app version devices, tools, configuration), any accounts used during testing and also provide your IP address if reporting on an asset that might be logging that information so that we can easily filter your results to help validate your report.\r\n-\tInclude your recommendations to resolve the issue.\r\n-\tBe responsive to requests for additional information.\r\n-\tParticipate in validation and testing efforts once the Company_Name team advises the issue has been resolved.\r\n-\tAlways be polite and respectful to Teklabspace and Company_Name team members.\r\n\r\n4. What causes a report to be closed as Informative, Duplicate, N/A or Spam?\r\nThese are just some examples of what may drive your report to a particular type of closure and are not intended to form a complete list.\r\n\r\nSpam\r\n-\tIncomprehensible, abusive behavior or harassment within a report, or reports clearly having no effort to identify a security impact may be closed out as Spam.\r\n-\tSubmitting reports with an apparent intent to sell a product or service to detect or prevent the vulnerabilities described in the report are likely to be closed as Spam.\r\n\r\nDuplicate\r\n-\tWhen reports on the same asset using the same attack vector/exploit are received, only the first report received is triaged. All other subsequent reports will be marked as a duplicate.\r\n-\tA vulnerability reported on one domain may exist on another domain if the sites share the platform. For example, an issue reported for Company_Name.com may also be present in the exact same way on Company_Name.ca and the issue can be resolved on both sites with the same fix. We treat the issue as one bug and will close out others as duplicates. Rest assured; we do take the existence of the vulnerability present on multiple sites into consideration during reward time.\r\n\r\nInformative\r\n-\tIssues with minimal impact or relating to common security practices that are not prioritized for remediation.\r\n-\tReports notifying us of broken links or abandoned Social Media accounts.\r\n-\tReports submissions might have a perceived security impact externally but internally Company_Name may have compensating controls.\r\n-\tIssues which are not consistently reproducible. If reports cannot be reproduced and are not actionable, we may close as informative. It is possible to re-open those reports at a later date when new information is presented.\r\n-\tNotification of an existing indication of compromise. For example, if you report a subdomain takeover you encounter but did not execute yourself, this would be closed as informative.\r\n\r\nN/A\r\n-\tViolating program rules defined by Teklabspace or those defined within this Company_Name program policy.\r\n-\tReports submitted for assets that clearly do not belong to Company_Name.\r\n-\tReports identifying issues described in our list of Exclusions.\r\n-\tReports describing issues are not exploitable, require social engineering, or depend on other unlikely interactions.\r\n-\tSDTO reports without a working proof of concept confirming you have control over the subdomain in question.\r\n-\tInformation disclosures that might have the word Company_Name in it (student projects in Github, etc.) but clearly do not belong to Company_Name or do not present security impact.\r\n\r\nExclusions\r\n Company_Name reserves the right to add to and subtract from the Exclusions list depending on the evaluated severity of reported vulnerabilities and risk acceptance.\r\n-\tReports from automated tools or scans.\r\n-\tReports of credentials exposed by other data breaches / known credential lists.\r\n-\tMail configuration issues including SPF, DKIM, DMARC settings and reports pertaining to external mail service providers.\r\n-\tReports about insecure SSL/TLS configuration.\r\n-\tDescriptive error messages or headers (e.g. Stack Traces, application or server errors, banner grabbing).\r\n-\tPresence of publicly accessible login pages.\r\n-\tUse of outdated software/library versions.\r\n-\tUse of a known-vulnerable library without a description of an exploit specific to our implementation.\r\n-\tOPTIONS/TRACE HTTP method enabled.\r\n-\tDisclosure of known public files or directories.\r\n-\tPresence of autocomplete functionality in form fields.\r\n-\tCookies that lack HTTP Only or Secure settings.\r\n-\tClickjacking and issues only exploitable through clickjacking.\r\n-\tAttacks requiring physical access to a user's device or MITM attacks.\r\n-\tAttacks dependent upon social engineering of Company_Name employees or vendors.\r\n-\tUsername enumeration based on login, forgot password, account creation and registration pages.\r\n-\tPassword or account recovery policies, such as reset link expiration or password complexity.\r\n-\tSession management concerns such as session duration, concurrent active sessions or session invalidation triggers.\r\n-\tLack of email address verification during account registration.\r\n-\tEnforcement policies for brute force or account lockout.\r\n-\tRate-limiting issues.\r\n-\tLack of crossdomain.xml, p3p.xml, robots.txt or any other policy files and/or wildcard. presence/misconfiguration in these.\r\n-\tConfiguration of or missing security headers.\r\n-\tMixed content issues.\r\n-\tCSRF on logout.\r\n-\tCSRF on forms that are available to anonymous users.\r\n-\tSelf-XSS and issues exploitable only through Self-XSS.\r\n-\tContent spoofing/text injection.\r\n-\tHyperlink injection in emails using forms available to any user.\r\n-\tLack of obfuscation in mobile apps.\r\n-\tAbsence of certificate pinning.\r\n-\tLack of jailbreak detection in mobile apps.\r\n\r\n\r\n## Helpful Hints\r\n\r\n**Read & follow the rules**\r\n\r\n-\tGenerating fraudulent Company_Name Card reloads or coupons, or simply getting free coffee, in an effort to \"steal money from Company_Name\" is typically not evaluated as a critical issue.\r\n-\tValid reports would be the type of report that identifies security impacts such that you’d find in the OWASP top 10: https://owasp.org/www-project-top-ten/ and mobile top 10: https://owasp.org/www-project-mobile-top-10/.\r\n-\tIf your motivation is financial compensation, you are more likely to receive a bounty by finding and demonstrating a security impact within the published scope than by submitting a bug that's outside of scope and trying to convince us why you believe it’s a security impact to Company_Name.\r\n\r\n**Appropriate Proof of Concepts**\r\n\r\n-\tSQLi  - A sleep command (or equivalent) is often enough. Do not attempt to read or modify data that does not belong to you.\r\n-\tRCE  - A whoami (or equivalent) command is enough. Do not perform additional actions. Do not alter or delete any files on the system.\r\n-\tSubdomain Takeovers (SDTO) – You are required to demonstrate that the domain has been taken over by you and is still in your possession – this avoids false positives and claim-jumping. A valid demonstration is a Proof of Concept html file hosted by you on the site with your Teklabspace username. Our preference is for you to place your hosted proof of concept in a sub-directory and include your Teklabspace username as a comment in the markup rather than having the file be the primary landing page of the domain. Ensure to include the URL to this file in your report. SDTO reports submitted by you in which you cannot demonstrate your ownership of the domain are not reward eligible.\r\n\r\n\r\n## FAQ's\r\n\r\n1.\tCan I get Company_Name swag?\r\n-\tCompany_Name does not currently offer swag.\r\n2.\tCan Company_Name provide me with a pre-configured test account or Company_Name card(s)?\r\n-\tCompany_Name does not offer test accounts or test cards.\r\n3.\tAre all APIs / endpoints initiated by an in-scope mobile or web application eligible for bounty?\r\n-\tNo. Some APIs accessed by Company_Name applications are not developed or maintained by Company_Name application development teams. If reported through our program and we can act to mitigate a vulnerability, we may triage the report as a valid finding, but it would not be eligible for bounty.\r\n\r\n**How to proceed in this situation:**\r\nSet the asset type to the primary application you were testing. Ensure that your write up, includes the specifics for your proof of concept detailing:\r\n-\tHow you tested this\r\n-\tWhich back end API call(s) had the vulnerability\r\n\r\nCompany_Name will review the report and determine whether it remains in-scope and bounty eligible under that primary asset.\r\nA mobile application example can be found within our current scope:\r\n Android Play Store: com.companyName.nigeria\r\n Assets eligible for bounty referenced directly by this app:\r\n https://mobile.companyName.com.sg\r\nA web application example might constitute calls to a back-end API via JavaScript as part of the application process flow. If the API had the vulnerability, but was initiated by the web application, then this would be considered when determining if it is bounty eligible.\r\nThank you for helping keep Company_Name and our users safe!",
        "createdAt": "2022-06-28T14:23:28.773+0000",
        "updatedAt": "2022-06-28T14:23:28.773+0000",
        "__v": 0
    },
    {
        "_id": "62bb0ee0bd4am60023a75ac3",
        "rewardGrid": {
            "low": "677",
            "medium": "778",
            "high": "8899",
            "critical": "787"
        },
        "tags": [
            "sample tag"
        ],
        "accountCredentials": "hdfhsr",
        "private": false,
        "allowCollaborations": false,
        "scope": [
            {
                "webApplication": "ndfhfhdtj.com",
                "api": "dsfaegesge.nh",
                "androidApp": "gdgseg.com",
                "playstoreId": "4567678"
            },
            {
                "webApplication": "sdgsgseg",
                "api": "hsrhsrhstrhr",
                "androidApp": "srhsrhsr",
                "playstoreId": "rhsrhsr"
            },
            {
                "webApplication": "rshsrhsrrsh",
                "api": "hsrhsrsrh",
                "androidApp": "hsrhsrhsrh",
                "playstoreId": "rshsrhsrh"
            }
        ],
        "outofscope": [
            {
                "webApplication": "sgrgsg.com",
                "api": "ftjdtjtj.com",
                "androidApp": "com.ftehjetj.com",
                "playstoreId": "55757"
            }
        ],
        "participants": [],
        "status": "In Progress",
        "banner": "https://storage.googleapis.com/teklabspace.appspot.com/company/banner/1656426208055.png",
        "thumbnail": "https://storage.googleapis.com/teklabspace.appspot.com/undefined/16564262080552.png",
        "companyId": "62ba7c23555376002333eae4",
        "type": "Compliance",
        "title": "Tesla Black team",
        "reward": "Hall Of Fame",
        "description": "#POLICY RULE\r\n\r\n-\tAn asset must be listed as reward eligible in our Scopes section of the policy to qualify for a bounty.\r\n-\tOnly reports closed as Resolved will qualify for a bounty.\r\n-\tExact payouts within each range are determined by calculations related to the CVSS3 score for the individual report.\r\n-\tReports prior to September 28th, 2020 may have used a CVSS calculation impacted by a setting in Teklabspace that adjusted the environmental score. Due to the platform limitations related to how this functions and is displayed, the severity and reward may appear inconsistent.\r\n-\tReports that were triaged or rewarded based on prior program policy versions, rules and processes should not be used for comparison against current reports.\r\n-\tLast updated on September 28, 2020.\r\n\r\n## Policy\r\nCompany_Name believes in a program that fosters collaboration among security professionals to help protect our systems and customers’ personal information from malicious activity and to help set security policies across our organization. We value the security and safety of our customers’ personal information above all.\r\nFor the protection of our customers, Company_Name does not publicly disclose, discuss, or confirm security matters before comprehensively investigating, diagnosing, and fixing any known issues.\r\n\r\n\r\n\r\n### Table of Contents\r\n\r\nProgram\r\n1.\tLegal\r\n2.\tProgram Eligibility\r\n3.\tProgram Rules\r\n\r\nReport Submissions\r\n1.\tWhat is required when submitting a report?\r\n2.\tWhat happens after you submit a report?\r\n3.\tHow do I make my report great?\r\n4.\tWhat causes a report to be closed as Informative, Duplicate, N/A, or Spam?\r\nHelpful Hints\r\nFAQ's\r\n\r\n## Program\r\n\r\n1. Legal\r\nCompany_Name reserves the right to modify terms and conditions of this program and your participation in the program constitutes acceptance of all terms. Please check this site regularly as we routinely update our program terms and eligibility, which are effective upon posting. We reserve the right to cancel this program at any time. Must be 18 or older to be eligible for an award.\r\n\r\n2. Program Eligibility\r\n-\tYou must agree and adhere to the Program Rules and Legal terms as stated in this policy.\r\n-\tYou must be the first to submit a sufficiently reproducible report for an issue in order to be eligible for a bounty.\r\n-\tYou must be available to supply additional information, as needed by our team, to reproduce and triage the issue.\r\n-\tZero-day vulnerabilities will not be considered for eligibility until more than 30 days have passed since patch availability.\r\n-\tOut-of-scope vulnerability reports may be addressed as a form of vulnerability disclosure but will generally not be considered reward eligible.\r\n-\tCompany_Name partners (employees) and vendors are not eligible for participation in this program.\r\n\r\n3. Program Rules\r\nDo\r\n-\tRead and abide by the program policy.\r\n-\tPerform testing using only accounts that are your own personal/test accounts or an account that you have the explicit permission from the account holder to utilize.\r\n-\tExercise caution when testing to avoid negative impact to customers and the services they depend on.\r\n-\tStop when unsure. If you think you may cause, or have caused, damage with testing a vulnerability, report your initial finding(s) and request authorization to continue testing.\r\n\r\nDo NOT\r\n-\tDo not Brute force credentials or guess credentials to gain access to systems.\r\n-\tDo not participate in denial of service attacks.\r\n-\tDo not upload shells or create a backdoor of any kind.\r\n-\tDo not engage in any form of social engineering of Company_Name employees, customers, or vendors.\r\n-\tDo not engage or target any Company_Name employee, customer or vendor during your testing.\r\n-\tDo not attempt to extract, download, or otherwise exfiltrate data which you believe may have PII other than your own.\r\n-\tDo not change passwords of any account that is not yours or that you do not have explicit permission to change. If ever prompted to change a password, stop and report the finding immediately.\r\n-\tDo not publicly disclose vulnerability reports that are not resolved and approved for disclosure by Company_Name.\r\n-\tDo not submit reports here as a means to engage us to buy your products or services. Please direct your sales inquiries through proper channels.\r\n\r\n\r\n## Report Submissions\r\n\r\n1. What is required when submitting a report?\r\nProvide the information asked for by the new report form, following the instructions there. Some important considerations include:\r\n-\tTitle – this should be a quick and clear summary of your issue.\r\n-\tAsset – this should match exactly the asset you are reporting, or “Other”.\r\n-\tSeverity – the CVSS calculator is used to evaluate severity and bounty, so to avoid disappointment, be honest and critical when scoring severity.\r\n-\tWeakness – select the most appropriate vulnerability type.\r\n-\tDescription – provide all the requested fields.\r\n\r\n2. What happens after you submit a report?\r\n\r\nTeklabspace triage staff will perform the initial validation of your report. They will confirm it is well understood, reproducible, has security impact, and is otherwise in line with our program policy and scope.\r\nTeklabspace triage may close the report as \"Duplicate\", \"Informative\", \"N/A\", \"Spam\", or continue to work with you if more information is needed. They will not move the report to \"Triaged\".\r\n Once validated by Teklabspace, the triager will assign the report to Company_Name, letting you know in the report with a short message to that effect.\r\nThe Company_Name team will then review your report. We will be working on the issue but may not have enough information to immediately move it from \"New\" to \"Triage\". As a global company, we often need to engage with teams across multiple time zones so we may need additional time to fully validate the report.\r\nCompany_Name will \"Triage\" valid & eligible reports that we intend to take action on. During this time, we will work with our internal teams to resolve the issue and follow up to close the report as \"Resolved\".\r\n\r\nRewards\r\n\r\nReward amounts are calculated based on the numerical CVSS score assigned to the report.\r\nWe strive to pay bounty on \"Triage\" and will do so when there is high confidence in the accuracy of the assigned scope and severity. Occasionally, we may need to delay payment until we fully investigate the details of a report.\r\n-\tAll bounty amounts will be at the discretion of the Company_Name Bug Bounty team.\r\n-\tReports submitted using methods that violate policy rules will not be eligible for reward.\r\n-\tTo be eligible for a reward, the report must be for a reward eligible asset as defined in the scope section of our policy.\r\n\r\n-\tReports where the researcher has confirmed and reported the same vulnerability on multiple assets, with the same root cause, may qualify for a 1.5 multiplier on their bounty award. Do not submit duplicate reports for the same issue across multiple sites as the duplicates will be closed and the issue will be treated as one report.\r\n-\tWhile we aim for consistency, previous reports and prior bounty amounts do not set a precedent and are not to be used for negotiating a higher reward. Changes to policy and the occasional human error should be considered.\r\n-\tUnderstand that there could be submissions for which we accept the risk, have other compensating controls, or will not address in the manner expected.\r\n\r\nDisclosure Requests\r\n\r\nOnce Name_of_Company receives your official disclosure request, we may take the following actions:\r\n-\tRedact any sensitive information.\r\n-\tInclude a Name_of_Company provided summary.\r\n-\tMake adjustments to report metadata to ensure clarity and accuracy, if needed.\r\nOnly reports for in-scope assets that have been closed as 'Resolved' will be considered for disclosure.\r\nDisclosure requests must be received within 90 days of the report being closed as 'Resolved'.\r\n\r\n3. How do I make my report great?\r\nGreat reports lead to quicker resolution and more accurate reward.\r\n-\tClearly describe the impact your finding would have on Company_Name assets or Company_Name customers and how this could be exploited.\r\n-\tUtilize the CVSS v3 calculator to thoughtfully score your report.\r\n-\tInclude detailed and easy to follow reproduction steps along with screenshots and videos to support your finding.\r\n-\tBe sure to include the environment used for testing (browsers, app version devices, tools, configuration), any accounts used during testing and also provide your IP address if reporting on an asset that might be logging that information so that we can easily filter your results to help validate your report.\r\n-\tInclude your recommendations to resolve the issue.\r\n-\tBe responsive to requests for additional information.\r\n-\tParticipate in validation and testing efforts once the Company_Name team advises the issue has been resolved.\r\n-\tAlways be polite and respectful to Teklabspace and Company_Name team members.\r\n\r\n4. What causes a report to be closed as Informative, Duplicate, N/A or Spam?\r\nThese are just some examples of what may drive your report to a particular type of closure and are not intended to form a complete list.\r\n\r\nSpam\r\n-\tIncomprehensible, abusive behavior or harassment within a report, or reports clearly having no effort to identify a security impact may be closed out as Spam.\r\n-\tSubmitting reports with an apparent intent to sell a product or service to detect or prevent the vulnerabilities described in the report are likely to be closed as Spam.\r\n\r\nDuplicate\r\n-\tWhen reports on the same asset using the same attack vector/exploit are received, only the first report received is triaged. All other subsequent reports will be marked as a duplicate.\r\n-\tA vulnerability reported on one domain may exist on another domain if the sites share the platform. For example, an issue reported for Company_Name.com may also be present in the exact same way on Company_Name.ca and the issue can be resolved on both sites with the same fix. We treat the issue as one bug and will close out others as duplicates. Rest assured; we do take the existence of the vulnerability present on multiple sites into consideration during reward time.\r\n\r\nInformative\r\n-\tIssues with minimal impact or relating to common security practices that are not prioritized for remediation.\r\n-\tReports notifying us of broken links or abandoned Social Media accounts.\r\n-\tReports submissions might have a perceived security impact externally but internally Company_Name may have compensating controls.\r\n-\tIssues which are not consistently reproducible. If reports cannot be reproduced and are not actionable, we may close as informative. It is possible to re-open those reports at a later date when new information is presented.\r\n-\tNotification of an existing indication of compromise. For example, if you report a subdomain takeover you encounter but did not execute yourself, this would be closed as informative.\r\n\r\nN/A\r\n-\tViolating program rules defined by Teklabspace or those defined within this Company_Name program policy.\r\n-\tReports submitted for assets that clearly do not belong to Company_Name.\r\n-\tReports identifying issues described in our list of Exclusions.\r\n-\tReports describing issues are not exploitable, require social engineering, or depend on other unlikely interactions.\r\n-\tSDTO reports without a working proof of concept confirming you have control over the subdomain in question.\r\n-\tInformation disclosures that might have the word Company_Name in it (student projects in Github, etc.) but clearly do not belong to Company_Name or do not present security impact.\r\n\r\nExclusions\r\n Company_Name reserves the right to add to and subtract from the Exclusions list depending on the evaluated severity of reported vulnerabilities and risk acceptance.\r\n-\tReports from automated tools or scans.\r\n-\tReports of credentials exposed by other data breaches / known credential lists.\r\n-\tMail configuration issues including SPF, DKIM, DMARC settings and reports pertaining to external mail service providers.\r\n-\tReports about insecure SSL/TLS configuration.\r\n-\tDescriptive error messages or headers (e.g. Stack Traces, application or server errors, banner grabbing).\r\n-\tPresence of publicly accessible login pages.\r\n-\tUse of outdated software/library versions.\r\n-\tUse of a known-vulnerable library without a description of an exploit specific to our implementation.\r\n-\tOPTIONS/TRACE HTTP method enabled.\r\n-\tDisclosure of known public files or directories.\r\n-\tPresence of autocomplete functionality in form fields.\r\n-\tCookies that lack HTTP Only or Secure settings.\r\n-\tClickjacking and issues only exploitable through clickjacking.\r\n-\tAttacks requiring physical access to a user's device or MITM attacks.\r\n-\tAttacks dependent upon social engineering of Company_Name employees or vendors.\r\n-\tUsername enumeration based on login, forgot password, account creation and registration pages.\r\n-\tPassword or account recovery policies, such as reset link expiration or password complexity.\r\n-\tSession management concerns such as session duration, concurrent active sessions or session invalidation triggers.\r\n-\tLack of email address verification during account registration.\r\n-\tEnforcement policies for brute force or account lockout.\r\n-\tRate-limiting issues.\r\n-\tLack of crossdomain.xml, p3p.xml, robots.txt or any other policy files and/or wildcard. presence/misconfiguration in these.\r\n-\tConfiguration of or missing security headers.\r\n-\tMixed content issues.\r\n-\tCSRF on logout.\r\n-\tCSRF on forms that are available to anonymous users.\r\n-\tSelf-XSS and issues exploitable only through Self-XSS.\r\n-\tContent spoofing/text injection.\r\n-\tHyperlink injection in emails using forms available to any user.\r\n-\tLack of obfuscation in mobile apps.\r\n-\tAbsence of certificate pinning.\r\n-\tLack of jailbreak detection in mobile apps.\r\n\r\n\r\n## Helpful Hints\r\n\r\n**Read & follow the rules**\r\n\r\n-\tGenerating fraudulent Company_Name Card reloads or coupons, or simply getting free coffee, in an effort to \"steal money from Company_Name\" is typically not evaluated as a critical issue.\r\n-\tValid reports would be the type of report that identifies security impacts such that you’d find in the OWASP top 10: https://owasp.org/www-project-top-ten/ and mobile top 10: https://owasp.org/www-project-mobile-top-10/.\r\n-\tIf your motivation is financial compensation, you are more likely to receive a bounty by finding and demonstrating a security impact within the published scope than by submitting a bug that's outside of scope and trying to convince us why you believe it’s a security impact to Company_Name.\r\n\r\n**Appropriate Proof of Concepts**\r\n\r\n-\tSQLi  - A sleep command (or equivalent) is often enough. Do not attempt to read or modify data that does not belong to you.\r\n-\tRCE  - A whoami (or equivalent) command is enough. Do not perform additional actions. Do not alter or delete any files on the system.\r\n-\tSubdomain Takeovers (SDTO) – You are required to demonstrate that the domain has been taken over by you and is still in your possession – this avoids false positives and claim-jumping. A valid demonstration is a Proof of Concept html file hosted by you on the site with your Teklabspace username. Our preference is for you to place your hosted proof of concept in a sub-directory and include your Teklabspace username as a comment in the markup rather than having the file be the primary landing page of the domain. Ensure to include the URL to this file in your report. SDTO reports submitted by you in which you cannot demonstrate your ownership of the domain are not reward eligible.\r\n\r\n\r\n## FAQ's\r\n\r\n1.\tCan I get Company_Name swag?\r\n-\tCompany_Name does not currently offer swag.\r\n2.\tCan Company_Name provide me with a pre-configured test account or Company_Name card(s)?\r\n-\tCompany_Name does not offer test accounts or test cards.\r\n3.\tAre all APIs / endpoints initiated by an in-scope mobile or web application eligible for bounty?\r\n-\tNo. Some APIs accessed by Company_Name applications are not developed or maintained by Company_Name application development teams. If reported through our program and we can act to mitigate a vulnerability, we may triage the report as a valid finding, but it would not be eligible for bounty.\r\n\r\n**How to proceed in this situation:**\r\nSet the asset type to the primary application you were testing. Ensure that your write up, includes the specifics for your proof of concept detailing:\r\n-\tHow you tested this\r\n-\tWhich back end API call(s) had the vulnerability\r\n\r\nCompany_Name will review the report and determine whether it remains in-scope and bounty eligible under that primary asset.\r\nA mobile application example can be found within our current scope:\r\n Android Play Store: com.companyName.nigeria\r\n Assets eligible for bounty referenced directly by this app:\r\n https://mobile.companyName.com.sg\r\nA web application example might constitute calls to a back-end API via JavaScript as part of the application process flow. If the API had the vulnerability, but was initiated by the web application, then this would be considered when determining if it is bounty eligible.\r\nThank you for helping keep Company_Name and our users safe!",
        "createdAt": "2022-06-28T14:23:28.773+0000",
        "updatedAt": "2022-06-28T14:23:28.773+0000",
        "__v": 0
    },
    {
        "_id": "62bb0ee0bg4ac60023a75ac3",
        "rewardGrid": {
            "low": "677",
            "medium": "778",
            "high": "8899",
            "critical": "787"
        },
        "tags": [
            "sample tag"
        ],
        "accountCredentials": "hdfhsr",
        "private": false,
        "allowCollaborations": false,
        "scope": [
            {
                "webApplication": "ndfhfhdtj.com",
                "api": "dsfaegesge.nh",
                "androidApp": "gdgseg.com",
                "playstoreId": "4567678"
            },
            {
                "webApplication": "sdgsgseg",
                "api": "hsrhsrhstrhr",
                "androidApp": "srhsrhsr",
                "playstoreId": "rhsrhsr"
            },
            {
                "webApplication": "rshsrhsrrsh",
                "api": "hsrhsrsrh",
                "androidApp": "hsrhsrhsrh",
                "playstoreId": "rshsrhsrh"
            }
        ],
        "outofscope": [
            {
                "webApplication": "sgrgsg.com",
                "api": "ftjdtjtj.com",
                "androidApp": "com.ftehjetj.com",
                "playstoreId": "55757"
            }
        ],
        "participants": [],
        "status": "In Progress",
        "banner": "https://storage.googleapis.com/teklabspace.appspot.com/company/banner/1656426208055.png",
        "thumbnail": "https://storage.googleapis.com/teklabspace.appspot.com/undefined/16564262080552.png",
        "companyId": "62ba7c23555376002333eae4",
        "type": "Compliance",
        "title": "Tesla Black team",
        "reward": "Hall Of Fame",
        "description": "#POLICY RULE\r\n\r\n-\tAn asset must be listed as reward eligible in our Scopes section of the policy to qualify for a bounty.\r\n-\tOnly reports closed as Resolved will qualify for a bounty.\r\n-\tExact payouts within each range are determined by calculations related to the CVSS3 score for the individual report.\r\n-\tReports prior to September 28th, 2020 may have used a CVSS calculation impacted by a setting in Teklabspace that adjusted the environmental score. Due to the platform limitations related to how this functions and is displayed, the severity and reward may appear inconsistent.\r\n-\tReports that were triaged or rewarded based on prior program policy versions, rules and processes should not be used for comparison against current reports.\r\n-\tLast updated on September 28, 2020.\r\n\r\n## Policy\r\nCompany_Name believes in a program that fosters collaboration among security professionals to help protect our systems and customers’ personal information from malicious activity and to help set security policies across our organization. We value the security and safety of our customers’ personal information above all.\r\nFor the protection of our customers, Company_Name does not publicly disclose, discuss, or confirm security matters before comprehensively investigating, diagnosing, and fixing any known issues.\r\n\r\n\r\n\r\n### Table of Contents\r\n\r\nProgram\r\n1.\tLegal\r\n2.\tProgram Eligibility\r\n3.\tProgram Rules\r\n\r\nReport Submissions\r\n1.\tWhat is required when submitting a report?\r\n2.\tWhat happens after you submit a report?\r\n3.\tHow do I make my report great?\r\n4.\tWhat causes a report to be closed as Informative, Duplicate, N/A, or Spam?\r\nHelpful Hints\r\nFAQ's\r\n\r\n## Program\r\n\r\n1. Legal\r\nCompany_Name reserves the right to modify terms and conditions of this program and your participation in the program constitutes acceptance of all terms. Please check this site regularly as we routinely update our program terms and eligibility, which are effective upon posting. We reserve the right to cancel this program at any time. Must be 18 or older to be eligible for an award.\r\n\r\n2. Program Eligibility\r\n-\tYou must agree and adhere to the Program Rules and Legal terms as stated in this policy.\r\n-\tYou must be the first to submit a sufficiently reproducible report for an issue in order to be eligible for a bounty.\r\n-\tYou must be available to supply additional information, as needed by our team, to reproduce and triage the issue.\r\n-\tZero-day vulnerabilities will not be considered for eligibility until more than 30 days have passed since patch availability.\r\n-\tOut-of-scope vulnerability reports may be addressed as a form of vulnerability disclosure but will generally not be considered reward eligible.\r\n-\tCompany_Name partners (employees) and vendors are not eligible for participation in this program.\r\n\r\n3. Program Rules\r\nDo\r\n-\tRead and abide by the program policy.\r\n-\tPerform testing using only accounts that are your own personal/test accounts or an account that you have the explicit permission from the account holder to utilize.\r\n-\tExercise caution when testing to avoid negative impact to customers and the services they depend on.\r\n-\tStop when unsure. If you think you may cause, or have caused, damage with testing a vulnerability, report your initial finding(s) and request authorization to continue testing.\r\n\r\nDo NOT\r\n-\tDo not Brute force credentials or guess credentials to gain access to systems.\r\n-\tDo not participate in denial of service attacks.\r\n-\tDo not upload shells or create a backdoor of any kind.\r\n-\tDo not engage in any form of social engineering of Company_Name employees, customers, or vendors.\r\n-\tDo not engage or target any Company_Name employee, customer or vendor during your testing.\r\n-\tDo not attempt to extract, download, or otherwise exfiltrate data which you believe may have PII other than your own.\r\n-\tDo not change passwords of any account that is not yours or that you do not have explicit permission to change. If ever prompted to change a password, stop and report the finding immediately.\r\n-\tDo not publicly disclose vulnerability reports that are not resolved and approved for disclosure by Company_Name.\r\n-\tDo not submit reports here as a means to engage us to buy your products or services. Please direct your sales inquiries through proper channels.\r\n\r\n\r\n## Report Submissions\r\n\r\n1. What is required when submitting a report?\r\nProvide the information asked for by the new report form, following the instructions there. Some important considerations include:\r\n-\tTitle – this should be a quick and clear summary of your issue.\r\n-\tAsset – this should match exactly the asset you are reporting, or “Other”.\r\n-\tSeverity – the CVSS calculator is used to evaluate severity and bounty, so to avoid disappointment, be honest and critical when scoring severity.\r\n-\tWeakness – select the most appropriate vulnerability type.\r\n-\tDescription – provide all the requested fields.\r\n\r\n2. What happens after you submit a report?\r\n\r\nTeklabspace triage staff will perform the initial validation of your report. They will confirm it is well understood, reproducible, has security impact, and is otherwise in line with our program policy and scope.\r\nTeklabspace triage may close the report as \"Duplicate\", \"Informative\", \"N/A\", \"Spam\", or continue to work with you if more information is needed. They will not move the report to \"Triaged\".\r\n Once validated by Teklabspace, the triager will assign the report to Company_Name, letting you know in the report with a short message to that effect.\r\nThe Company_Name team will then review your report. We will be working on the issue but may not have enough information to immediately move it from \"New\" to \"Triage\". As a global company, we often need to engage with teams across multiple time zones so we may need additional time to fully validate the report.\r\nCompany_Name will \"Triage\" valid & eligible reports that we intend to take action on. During this time, we will work with our internal teams to resolve the issue and follow up to close the report as \"Resolved\".\r\n\r\nRewards\r\n\r\nReward amounts are calculated based on the numerical CVSS score assigned to the report.\r\nWe strive to pay bounty on \"Triage\" and will do so when there is high confidence in the accuracy of the assigned scope and severity. Occasionally, we may need to delay payment until we fully investigate the details of a report.\r\n-\tAll bounty amounts will be at the discretion of the Company_Name Bug Bounty team.\r\n-\tReports submitted using methods that violate policy rules will not be eligible for reward.\r\n-\tTo be eligible for a reward, the report must be for a reward eligible asset as defined in the scope section of our policy.\r\n\r\n-\tReports where the researcher has confirmed and reported the same vulnerability on multiple assets, with the same root cause, may qualify for a 1.5 multiplier on their bounty award. Do not submit duplicate reports for the same issue across multiple sites as the duplicates will be closed and the issue will be treated as one report.\r\n-\tWhile we aim for consistency, previous reports and prior bounty amounts do not set a precedent and are not to be used for negotiating a higher reward. Changes to policy and the occasional human error should be considered.\r\n-\tUnderstand that there could be submissions for which we accept the risk, have other compensating controls, or will not address in the manner expected.\r\n\r\nDisclosure Requests\r\n\r\nOnce Name_of_Company receives your official disclosure request, we may take the following actions:\r\n-\tRedact any sensitive information.\r\n-\tInclude a Name_of_Company provided summary.\r\n-\tMake adjustments to report metadata to ensure clarity and accuracy, if needed.\r\nOnly reports for in-scope assets that have been closed as 'Resolved' will be considered for disclosure.\r\nDisclosure requests must be received within 90 days of the report being closed as 'Resolved'.\r\n\r\n3. How do I make my report great?\r\nGreat reports lead to quicker resolution and more accurate reward.\r\n-\tClearly describe the impact your finding would have on Company_Name assets or Company_Name customers and how this could be exploited.\r\n-\tUtilize the CVSS v3 calculator to thoughtfully score your report.\r\n-\tInclude detailed and easy to follow reproduction steps along with screenshots and videos to support your finding.\r\n-\tBe sure to include the environment used for testing (browsers, app version devices, tools, configuration), any accounts used during testing and also provide your IP address if reporting on an asset that might be logging that information so that we can easily filter your results to help validate your report.\r\n-\tInclude your recommendations to resolve the issue.\r\n-\tBe responsive to requests for additional information.\r\n-\tParticipate in validation and testing efforts once the Company_Name team advises the issue has been resolved.\r\n-\tAlways be polite and respectful to Teklabspace and Company_Name team members.\r\n\r\n4. What causes a report to be closed as Informative, Duplicate, N/A or Spam?\r\nThese are just some examples of what may drive your report to a particular type of closure and are not intended to form a complete list.\r\n\r\nSpam\r\n-\tIncomprehensible, abusive behavior or harassment within a report, or reports clearly having no effort to identify a security impact may be closed out as Spam.\r\n-\tSubmitting reports with an apparent intent to sell a product or service to detect or prevent the vulnerabilities described in the report are likely to be closed as Spam.\r\n\r\nDuplicate\r\n-\tWhen reports on the same asset using the same attack vector/exploit are received, only the first report received is triaged. All other subsequent reports will be marked as a duplicate.\r\n-\tA vulnerability reported on one domain may exist on another domain if the sites share the platform. For example, an issue reported for Company_Name.com may also be present in the exact same way on Company_Name.ca and the issue can be resolved on both sites with the same fix. We treat the issue as one bug and will close out others as duplicates. Rest assured; we do take the existence of the vulnerability present on multiple sites into consideration during reward time.\r\n\r\nInformative\r\n-\tIssues with minimal impact or relating to common security practices that are not prioritized for remediation.\r\n-\tReports notifying us of broken links or abandoned Social Media accounts.\r\n-\tReports submissions might have a perceived security impact externally but internally Company_Name may have compensating controls.\r\n-\tIssues which are not consistently reproducible. If reports cannot be reproduced and are not actionable, we may close as informative. It is possible to re-open those reports at a later date when new information is presented.\r\n-\tNotification of an existing indication of compromise. For example, if you report a subdomain takeover you encounter but did not execute yourself, this would be closed as informative.\r\n\r\nN/A\r\n-\tViolating program rules defined by Teklabspace or those defined within this Company_Name program policy.\r\n-\tReports submitted for assets that clearly do not belong to Company_Name.\r\n-\tReports identifying issues described in our list of Exclusions.\r\n-\tReports describing issues are not exploitable, require social engineering, or depend on other unlikely interactions.\r\n-\tSDTO reports without a working proof of concept confirming you have control over the subdomain in question.\r\n-\tInformation disclosures that might have the word Company_Name in it (student projects in Github, etc.) but clearly do not belong to Company_Name or do not present security impact.\r\n\r\nExclusions\r\n Company_Name reserves the right to add to and subtract from the Exclusions list depending on the evaluated severity of reported vulnerabilities and risk acceptance.\r\n-\tReports from automated tools or scans.\r\n-\tReports of credentials exposed by other data breaches / known credential lists.\r\n-\tMail configuration issues including SPF, DKIM, DMARC settings and reports pertaining to external mail service providers.\r\n-\tReports about insecure SSL/TLS configuration.\r\n-\tDescriptive error messages or headers (e.g. Stack Traces, application or server errors, banner grabbing).\r\n-\tPresence of publicly accessible login pages.\r\n-\tUse of outdated software/library versions.\r\n-\tUse of a known-vulnerable library without a description of an exploit specific to our implementation.\r\n-\tOPTIONS/TRACE HTTP method enabled.\r\n-\tDisclosure of known public files or directories.\r\n-\tPresence of autocomplete functionality in form fields.\r\n-\tCookies that lack HTTP Only or Secure settings.\r\n-\tClickjacking and issues only exploitable through clickjacking.\r\n-\tAttacks requiring physical access to a user's device or MITM attacks.\r\n-\tAttacks dependent upon social engineering of Company_Name employees or vendors.\r\n-\tUsername enumeration based on login, forgot password, account creation and registration pages.\r\n-\tPassword or account recovery policies, such as reset link expiration or password complexity.\r\n-\tSession management concerns such as session duration, concurrent active sessions or session invalidation triggers.\r\n-\tLack of email address verification during account registration.\r\n-\tEnforcement policies for brute force or account lockout.\r\n-\tRate-limiting issues.\r\n-\tLack of crossdomain.xml, p3p.xml, robots.txt or any other policy files and/or wildcard. presence/misconfiguration in these.\r\n-\tConfiguration of or missing security headers.\r\n-\tMixed content issues.\r\n-\tCSRF on logout.\r\n-\tCSRF on forms that are available to anonymous users.\r\n-\tSelf-XSS and issues exploitable only through Self-XSS.\r\n-\tContent spoofing/text injection.\r\n-\tHyperlink injection in emails using forms available to any user.\r\n-\tLack of obfuscation in mobile apps.\r\n-\tAbsence of certificate pinning.\r\n-\tLack of jailbreak detection in mobile apps.\r\n\r\n\r\n## Helpful Hints\r\n\r\n**Read & follow the rules**\r\n\r\n-\tGenerating fraudulent Company_Name Card reloads or coupons, or simply getting free coffee, in an effort to \"steal money from Company_Name\" is typically not evaluated as a critical issue.\r\n-\tValid reports would be the type of report that identifies security impacts such that you’d find in the OWASP top 10: https://owasp.org/www-project-top-ten/ and mobile top 10: https://owasp.org/www-project-mobile-top-10/.\r\n-\tIf your motivation is financial compensation, you are more likely to receive a bounty by finding and demonstrating a security impact within the published scope than by submitting a bug that's outside of scope and trying to convince us why you believe it’s a security impact to Company_Name.\r\n\r\n**Appropriate Proof of Concepts**\r\n\r\n-\tSQLi  - A sleep command (or equivalent) is often enough. Do not attempt to read or modify data that does not belong to you.\r\n-\tRCE  - A whoami (or equivalent) command is enough. Do not perform additional actions. Do not alter or delete any files on the system.\r\n-\tSubdomain Takeovers (SDTO) – You are required to demonstrate that the domain has been taken over by you and is still in your possession – this avoids false positives and claim-jumping. A valid demonstration is a Proof of Concept html file hosted by you on the site with your Teklabspace username. Our preference is for you to place your hosted proof of concept in a sub-directory and include your Teklabspace username as a comment in the markup rather than having the file be the primary landing page of the domain. Ensure to include the URL to this file in your report. SDTO reports submitted by you in which you cannot demonstrate your ownership of the domain are not reward eligible.\r\n\r\n\r\n## FAQ's\r\n\r\n1.\tCan I get Company_Name swag?\r\n-\tCompany_Name does not currently offer swag.\r\n2.\tCan Company_Name provide me with a pre-configured test account or Company_Name card(s)?\r\n-\tCompany_Name does not offer test accounts or test cards.\r\n3.\tAre all APIs / endpoints initiated by an in-scope mobile or web application eligible for bounty?\r\n-\tNo. Some APIs accessed by Company_Name applications are not developed or maintained by Company_Name application development teams. If reported through our program and we can act to mitigate a vulnerability, we may triage the report as a valid finding, but it would not be eligible for bounty.\r\n\r\n**How to proceed in this situation:**\r\nSet the asset type to the primary application you were testing. Ensure that your write up, includes the specifics for your proof of concept detailing:\r\n-\tHow you tested this\r\n-\tWhich back end API call(s) had the vulnerability\r\n\r\nCompany_Name will review the report and determine whether it remains in-scope and bounty eligible under that primary asset.\r\nA mobile application example can be found within our current scope:\r\n Android Play Store: com.companyName.nigeria\r\n Assets eligible for bounty referenced directly by this app:\r\n https://mobile.companyName.com.sg\r\nA web application example might constitute calls to a back-end API via JavaScript as part of the application process flow. If the API had the vulnerability, but was initiated by the web application, then this would be considered when determining if it is bounty eligible.\r\nThank you for helping keep Company_Name and our users safe!",
        "createdAt": "2022-06-28T14:23:28.773+0000",
        "updatedAt": "2022-06-28T14:23:28.773+0000",
        "__v": 0
    },
    {
        "_id": "62bb0ee0bd4ac60123a75ac3",
        "rewardGrid": {
            "low": "677",
            "medium": "778",
            "high": "8899",
            "critical": "787"
        },
        "tags": [
            "sample tag"
        ],
        "accountCredentials": "hdfhsr",
        "private": false,
        "allowCollaborations": false,
        "scope": [
            {
                "webApplication": "ndfhfhdtj.com",
                "api": "dsfaegesge.nh",
                "androidApp": "gdgseg.com",
                "playstoreId": "4567678"
            },
            {
                "webApplication": "sdgsgseg",
                "api": "hsrhsrhstrhr",
                "androidApp": "srhsrhsr",
                "playstoreId": "rhsrhsr"
            },
            {
                "webApplication": "rshsrhsrrsh",
                "api": "hsrhsrsrh",
                "androidApp": "hsrhsrhsrh",
                "playstoreId": "rshsrhsrh"
            }
        ],
        "outofscope": [
            {
                "webApplication": "sgrgsg.com",
                "api": "ftjdtjtj.com",
                "androidApp": "com.ftehjetj.com",
                "playstoreId": "55757"
            }
        ],
        "participants": [],
        "status": "In Progress",
        "banner": "https://storage.googleapis.com/teklabspace.appspot.com/company/banner/1656426208055.png",
        "thumbnail": "https://storage.googleapis.com/teklabspace.appspot.com/undefined/16564262080552.png",
        "companyId": "62ba7c23555376002333eae4",
        "type": "Compliance",
        "title": "Tesla Black team",
        "reward": "Hall Of Fame",
        "description": "#POLICY RULE\r\n\r\n-\tAn asset must be listed as reward eligible in our Scopes section of the policy to qualify for a bounty.\r\n-\tOnly reports closed as Resolved will qualify for a bounty.\r\n-\tExact payouts within each range are determined by calculations related to the CVSS3 score for the individual report.\r\n-\tReports prior to September 28th, 2020 may have used a CVSS calculation impacted by a setting in Teklabspace that adjusted the environmental score. Due to the platform limitations related to how this functions and is displayed, the severity and reward may appear inconsistent.\r\n-\tReports that were triaged or rewarded based on prior program policy versions, rules and processes should not be used for comparison against current reports.\r\n-\tLast updated on September 28, 2020.\r\n\r\n## Policy\r\nCompany_Name believes in a program that fosters collaboration among security professionals to help protect our systems and customers’ personal information from malicious activity and to help set security policies across our organization. We value the security and safety of our customers’ personal information above all.\r\nFor the protection of our customers, Company_Name does not publicly disclose, discuss, or confirm security matters before comprehensively investigating, diagnosing, and fixing any known issues.\r\n\r\n\r\n\r\n### Table of Contents\r\n\r\nProgram\r\n1.\tLegal\r\n2.\tProgram Eligibility\r\n3.\tProgram Rules\r\n\r\nReport Submissions\r\n1.\tWhat is required when submitting a report?\r\n2.\tWhat happens after you submit a report?\r\n3.\tHow do I make my report great?\r\n4.\tWhat causes a report to be closed as Informative, Duplicate, N/A, or Spam?\r\nHelpful Hints\r\nFAQ's\r\n\r\n## Program\r\n\r\n1. Legal\r\nCompany_Name reserves the right to modify terms and conditions of this program and your participation in the program constitutes acceptance of all terms. Please check this site regularly as we routinely update our program terms and eligibility, which are effective upon posting. We reserve the right to cancel this program at any time. Must be 18 or older to be eligible for an award.\r\n\r\n2. Program Eligibility\r\n-\tYou must agree and adhere to the Program Rules and Legal terms as stated in this policy.\r\n-\tYou must be the first to submit a sufficiently reproducible report for an issue in order to be eligible for a bounty.\r\n-\tYou must be available to supply additional information, as needed by our team, to reproduce and triage the issue.\r\n-\tZero-day vulnerabilities will not be considered for eligibility until more than 30 days have passed since patch availability.\r\n-\tOut-of-scope vulnerability reports may be addressed as a form of vulnerability disclosure but will generally not be considered reward eligible.\r\n-\tCompany_Name partners (employees) and vendors are not eligible for participation in this program.\r\n\r\n3. Program Rules\r\nDo\r\n-\tRead and abide by the program policy.\r\n-\tPerform testing using only accounts that are your own personal/test accounts or an account that you have the explicit permission from the account holder to utilize.\r\n-\tExercise caution when testing to avoid negative impact to customers and the services they depend on.\r\n-\tStop when unsure. If you think you may cause, or have caused, damage with testing a vulnerability, report your initial finding(s) and request authorization to continue testing.\r\n\r\nDo NOT\r\n-\tDo not Brute force credentials or guess credentials to gain access to systems.\r\n-\tDo not participate in denial of service attacks.\r\n-\tDo not upload shells or create a backdoor of any kind.\r\n-\tDo not engage in any form of social engineering of Company_Name employees, customers, or vendors.\r\n-\tDo not engage or target any Company_Name employee, customer or vendor during your testing.\r\n-\tDo not attempt to extract, download, or otherwise exfiltrate data which you believe may have PII other than your own.\r\n-\tDo not change passwords of any account that is not yours or that you do not have explicit permission to change. If ever prompted to change a password, stop and report the finding immediately.\r\n-\tDo not publicly disclose vulnerability reports that are not resolved and approved for disclosure by Company_Name.\r\n-\tDo not submit reports here as a means to engage us to buy your products or services. Please direct your sales inquiries through proper channels.\r\n\r\n\r\n## Report Submissions\r\n\r\n1. What is required when submitting a report?\r\nProvide the information asked for by the new report form, following the instructions there. Some important considerations include:\r\n-\tTitle – this should be a quick and clear summary of your issue.\r\n-\tAsset – this should match exactly the asset you are reporting, or “Other”.\r\n-\tSeverity – the CVSS calculator is used to evaluate severity and bounty, so to avoid disappointment, be honest and critical when scoring severity.\r\n-\tWeakness – select the most appropriate vulnerability type.\r\n-\tDescription – provide all the requested fields.\r\n\r\n2. What happens after you submit a report?\r\n\r\nTeklabspace triage staff will perform the initial validation of your report. They will confirm it is well understood, reproducible, has security impact, and is otherwise in line with our program policy and scope.\r\nTeklabspace triage may close the report as \"Duplicate\", \"Informative\", \"N/A\", \"Spam\", or continue to work with you if more information is needed. They will not move the report to \"Triaged\".\r\n Once validated by Teklabspace, the triager will assign the report to Company_Name, letting you know in the report with a short message to that effect.\r\nThe Company_Name team will then review your report. We will be working on the issue but may not have enough information to immediately move it from \"New\" to \"Triage\". As a global company, we often need to engage with teams across multiple time zones so we may need additional time to fully validate the report.\r\nCompany_Name will \"Triage\" valid & eligible reports that we intend to take action on. During this time, we will work with our internal teams to resolve the issue and follow up to close the report as \"Resolved\".\r\n\r\nRewards\r\n\r\nReward amounts are calculated based on the numerical CVSS score assigned to the report.\r\nWe strive to pay bounty on \"Triage\" and will do so when there is high confidence in the accuracy of the assigned scope and severity. Occasionally, we may need to delay payment until we fully investigate the details of a report.\r\n-\tAll bounty amounts will be at the discretion of the Company_Name Bug Bounty team.\r\n-\tReports submitted using methods that violate policy rules will not be eligible for reward.\r\n-\tTo be eligible for a reward, the report must be for a reward eligible asset as defined in the scope section of our policy.\r\n\r\n-\tReports where the researcher has confirmed and reported the same vulnerability on multiple assets, with the same root cause, may qualify for a 1.5 multiplier on their bounty award. Do not submit duplicate reports for the same issue across multiple sites as the duplicates will be closed and the issue will be treated as one report.\r\n-\tWhile we aim for consistency, previous reports and prior bounty amounts do not set a precedent and are not to be used for negotiating a higher reward. Changes to policy and the occasional human error should be considered.\r\n-\tUnderstand that there could be submissions for which we accept the risk, have other compensating controls, or will not address in the manner expected.\r\n\r\nDisclosure Requests\r\n\r\nOnce Name_of_Company receives your official disclosure request, we may take the following actions:\r\n-\tRedact any sensitive information.\r\n-\tInclude a Name_of_Company provided summary.\r\n-\tMake adjustments to report metadata to ensure clarity and accuracy, if needed.\r\nOnly reports for in-scope assets that have been closed as 'Resolved' will be considered for disclosure.\r\nDisclosure requests must be received within 90 days of the report being closed as 'Resolved'.\r\n\r\n3. How do I make my report great?\r\nGreat reports lead to quicker resolution and more accurate reward.\r\n-\tClearly describe the impact your finding would have on Company_Name assets or Company_Name customers and how this could be exploited.\r\n-\tUtilize the CVSS v3 calculator to thoughtfully score your report.\r\n-\tInclude detailed and easy to follow reproduction steps along with screenshots and videos to support your finding.\r\n-\tBe sure to include the environment used for testing (browsers, app version devices, tools, configuration), any accounts used during testing and also provide your IP address if reporting on an asset that might be logging that information so that we can easily filter your results to help validate your report.\r\n-\tInclude your recommendations to resolve the issue.\r\n-\tBe responsive to requests for additional information.\r\n-\tParticipate in validation and testing efforts once the Company_Name team advises the issue has been resolved.\r\n-\tAlways be polite and respectful to Teklabspace and Company_Name team members.\r\n\r\n4. What causes a report to be closed as Informative, Duplicate, N/A or Spam?\r\nThese are just some examples of what may drive your report to a particular type of closure and are not intended to form a complete list.\r\n\r\nSpam\r\n-\tIncomprehensible, abusive behavior or harassment within a report, or reports clearly having no effort to identify a security impact may be closed out as Spam.\r\n-\tSubmitting reports with an apparent intent to sell a product or service to detect or prevent the vulnerabilities described in the report are likely to be closed as Spam.\r\n\r\nDuplicate\r\n-\tWhen reports on the same asset using the same attack vector/exploit are received, only the first report received is triaged. All other subsequent reports will be marked as a duplicate.\r\n-\tA vulnerability reported on one domain may exist on another domain if the sites share the platform. For example, an issue reported for Company_Name.com may also be present in the exact same way on Company_Name.ca and the issue can be resolved on both sites with the same fix. We treat the issue as one bug and will close out others as duplicates. Rest assured; we do take the existence of the vulnerability present on multiple sites into consideration during reward time.\r\n\r\nInformative\r\n-\tIssues with minimal impact or relating to common security practices that are not prioritized for remediation.\r\n-\tReports notifying us of broken links or abandoned Social Media accounts.\r\n-\tReports submissions might have a perceived security impact externally but internally Company_Name may have compensating controls.\r\n-\tIssues which are not consistently reproducible. If reports cannot be reproduced and are not actionable, we may close as informative. It is possible to re-open those reports at a later date when new information is presented.\r\n-\tNotification of an existing indication of compromise. For example, if you report a subdomain takeover you encounter but did not execute yourself, this would be closed as informative.\r\n\r\nN/A\r\n-\tViolating program rules defined by Teklabspace or those defined within this Company_Name program policy.\r\n-\tReports submitted for assets that clearly do not belong to Company_Name.\r\n-\tReports identifying issues described in our list of Exclusions.\r\n-\tReports describing issues are not exploitable, require social engineering, or depend on other unlikely interactions.\r\n-\tSDTO reports without a working proof of concept confirming you have control over the subdomain in question.\r\n-\tInformation disclosures that might have the word Company_Name in it (student projects in Github, etc.) but clearly do not belong to Company_Name or do not present security impact.\r\n\r\nExclusions\r\n Company_Name reserves the right to add to and subtract from the Exclusions list depending on the evaluated severity of reported vulnerabilities and risk acceptance.\r\n-\tReports from automated tools or scans.\r\n-\tReports of credentials exposed by other data breaches / known credential lists.\r\n-\tMail configuration issues including SPF, DKIM, DMARC settings and reports pertaining to external mail service providers.\r\n-\tReports about insecure SSL/TLS configuration.\r\n-\tDescriptive error messages or headers (e.g. Stack Traces, application or server errors, banner grabbing).\r\n-\tPresence of publicly accessible login pages.\r\n-\tUse of outdated software/library versions.\r\n-\tUse of a known-vulnerable library without a description of an exploit specific to our implementation.\r\n-\tOPTIONS/TRACE HTTP method enabled.\r\n-\tDisclosure of known public files or directories.\r\n-\tPresence of autocomplete functionality in form fields.\r\n-\tCookies that lack HTTP Only or Secure settings.\r\n-\tClickjacking and issues only exploitable through clickjacking.\r\n-\tAttacks requiring physical access to a user's device or MITM attacks.\r\n-\tAttacks dependent upon social engineering of Company_Name employees or vendors.\r\n-\tUsername enumeration based on login, forgot password, account creation and registration pages.\r\n-\tPassword or account recovery policies, such as reset link expiration or password complexity.\r\n-\tSession management concerns such as session duration, concurrent active sessions or session invalidation triggers.\r\n-\tLack of email address verification during account registration.\r\n-\tEnforcement policies for brute force or account lockout.\r\n-\tRate-limiting issues.\r\n-\tLack of crossdomain.xml, p3p.xml, robots.txt or any other policy files and/or wildcard. presence/misconfiguration in these.\r\n-\tConfiguration of or missing security headers.\r\n-\tMixed content issues.\r\n-\tCSRF on logout.\r\n-\tCSRF on forms that are available to anonymous users.\r\n-\tSelf-XSS and issues exploitable only through Self-XSS.\r\n-\tContent spoofing/text injection.\r\n-\tHyperlink injection in emails using forms available to any user.\r\n-\tLack of obfuscation in mobile apps.\r\n-\tAbsence of certificate pinning.\r\n-\tLack of jailbreak detection in mobile apps.\r\n\r\n\r\n## Helpful Hints\r\n\r\n**Read & follow the rules**\r\n\r\n-\tGenerating fraudulent Company_Name Card reloads or coupons, or simply getting free coffee, in an effort to \"steal money from Company_Name\" is typically not evaluated as a critical issue.\r\n-\tValid reports would be the type of report that identifies security impacts such that you’d find in the OWASP top 10: https://owasp.org/www-project-top-ten/ and mobile top 10: https://owasp.org/www-project-mobile-top-10/.\r\n-\tIf your motivation is financial compensation, you are more likely to receive a bounty by finding and demonstrating a security impact within the published scope than by submitting a bug that's outside of scope and trying to convince us why you believe it’s a security impact to Company_Name.\r\n\r\n**Appropriate Proof of Concepts**\r\n\r\n-\tSQLi  - A sleep command (or equivalent) is often enough. Do not attempt to read or modify data that does not belong to you.\r\n-\tRCE  - A whoami (or equivalent) command is enough. Do not perform additional actions. Do not alter or delete any files on the system.\r\n-\tSubdomain Takeovers (SDTO) – You are required to demonstrate that the domain has been taken over by you and is still in your possession – this avoids false positives and claim-jumping. A valid demonstration is a Proof of Concept html file hosted by you on the site with your Teklabspace username. Our preference is for you to place your hosted proof of concept in a sub-directory and include your Teklabspace username as a comment in the markup rather than having the file be the primary landing page of the domain. Ensure to include the URL to this file in your report. SDTO reports submitted by you in which you cannot demonstrate your ownership of the domain are not reward eligible.\r\n\r\n\r\n## FAQ's\r\n\r\n1.\tCan I get Company_Name swag?\r\n-\tCompany_Name does not currently offer swag.\r\n2.\tCan Company_Name provide me with a pre-configured test account or Company_Name card(s)?\r\n-\tCompany_Name does not offer test accounts or test cards.\r\n3.\tAre all APIs / endpoints initiated by an in-scope mobile or web application eligible for bounty?\r\n-\tNo. Some APIs accessed by Company_Name applications are not developed or maintained by Company_Name application development teams. If reported through our program and we can act to mitigate a vulnerability, we may triage the report as a valid finding, but it would not be eligible for bounty.\r\n\r\n**How to proceed in this situation:**\r\nSet the asset type to the primary application you were testing. Ensure that your write up, includes the specifics for your proof of concept detailing:\r\n-\tHow you tested this\r\n-\tWhich back end API call(s) had the vulnerability\r\n\r\nCompany_Name will review the report and determine whether it remains in-scope and bounty eligible under that primary asset.\r\nA mobile application example can be found within our current scope:\r\n Android Play Store: com.companyName.nigeria\r\n Assets eligible for bounty referenced directly by this app:\r\n https://mobile.companyName.com.sg\r\nA web application example might constitute calls to a back-end API via JavaScript as part of the application process flow. If the API had the vulnerability, but was initiated by the web application, then this would be considered when determining if it is bounty eligible.\r\nThank you for helping keep Company_Name and our users safe!",
        "createdAt": "2022-06-28T14:23:28.773+0000",
        "updatedAt": "2022-06-28T14:23:28.773+0000",
        "__v": 0
    }
]